:PROPERTIES:
:ID:       d5d67aa4-e66e-48de-90d1-051ef3a8df77
:END:
#+title: Pop_os
#+date: 2021-11-26 18:20 PM
#+updated: 2026-01-05 11:09 AM
#+filetags: :linux:

* System Information
  #+begin_src shell
  cat /etc/os-release
  #+end_src

  #+RESULTS:
  | Pop!_OS                              |         |      |
  | VERSION="22.04                       | LTS"    |      |
  | ID=pop                               |         |      |
  | ID_LIKE="ubuntu                      | debian" |      |
  | PRETTY_NAME="Pop!_OS                 | 22.04   | LTS" |
  | 22.04                                |         |      |
  | https://pop.system76.com             |         |      |
  | https://support.system76.com         |         |      |
  | https://github.com/pop-os/pop/issues |         |      |
  | https://system76.com/privacy         |         |      |
  | VERSION_CODENAME=jammy               |         |      |
  | UBUNTU_CODENAME=jammy                |         |      |
  | LOGO=distributor-logo-pop-os         |         |      |

*** See which devices are wakeup disabled
     #+begin_src shell
     grep . /sys/bus/usb/devices/*/power/wakeup
     #+end_src

     #+RESULTS:
     | /sys/bus/usb/devices/3-14/power/wakeup:disabled |
     | /sys/bus/usb/devices/3-2/power/wakeup:disabled  |
     | /sys/bus/usb/devices/3-4.1/power/wakeup:enabled |
     | /sys/bus/usb/devices/3-4.2/power/wakeup:enabled |
     | /sys/bus/usb/devices/3-4/power/wakeup:disabled  |
     | /sys/bus/usb/devices/4-3/power/wakeup:disabled  |
     | /sys/bus/usb/devices/4-4/power/wakeup:disabled  |
     | /sys/bus/usb/devices/usb1/power/wakeup:disabled |
     | /sys/bus/usb/devices/usb2/power/wakeup:disabled |
     | /sys/bus/usb/devices/usb3/power/wakeup:disabled |
     | /sys/bus/usb/devices/usb4/power/wakeup:disabled |

